const buttons = document.getElementById("buttons");
var praza = document.querySelector("p");
buttons.onclick = function aforizmebisfunqcia(){
    var aporizmebi = [
    '"არ-დავიწყება მოყვრისა აროდეს გვიზამს ზიანსა"',
    '"ბოროტსა სძლია კეთილმან, არსება მისი გრძელია"',
    '"გრძელი სიტყვა მოკლედ ითქმის, შაირია ამად კარგი"',
    '"გველსა ხვრელით ამოიყვანს ენა ტკბილად მოუბარი"',
    '"ვჰგმობ მუხთალსა საწუთროსა, ზოგჯერ უხვსა, ზოგჯერ ძვირსა"',
    '"ვინ მოყვარესა არ ეძებს, იგი თავისა მტერია"',
    '"ვჰგმობ კაცსა აუგიანსა, ცრუსა და ღალატიანსა"',
    '"ზოგჯერ თქმა სჯობს არა-თქმასა, ზოგჯერ თქმითაც დაშავდების"',
    '"თუ თავი შენი შენ გახლავს, ღარიბად არ იხსენების"',
    '"იგი წავა და სხვა მოვა ტურფასა საბაღნაროსა"',
    '"კაცი ბრძენი ვერ გასწირავს მოყვარესა მოყვარულსა"',
    '"კოკასა შიგან რაცა დგას, იგივე წარმოსდინდების"',
    '"ლეკვი ლომისა სწორია, ძუ იყოს, თუნდა ხვადია"',
    '"რასაცა გასცემ შენია, რასც არა, დაკარგულია"',
    '"რაცა ღმერთსა არა სწადდეს, არა საქმე არ იქმნების"']
        
        praza.innerHTML = aporizmebi[Math.floor(Math.random() * aporizmebi.length)];
       
}




